bloombloombloom/Bloom/src/Targets/TargetDescriptionFiles/AVR8/TINY/ATTINY87.xml
                <register caption="MCU Control Register" name="MCUCR" offset="0x55" size="1">
                    <bitfield caption="BOD Sleep" mask="0x40" name="BODS"/>
                    <bitfield caption="BOD Sleep Enable" mask="0x20" name="BODSE"/>
                    <bitfield caption="Pull-up Disable" mask="0x10" name="PUD"/>
                </register>
                <register caption="MCU Status register" name="MCUSR" offset="0x54" size="1">
                    <bitfield caption="Watchdog Reset Flag" mask="0x08" name="WDRF"/>
                    <bitfield caption="Brown-out Reset Flag" mask="0x04" name="BORF"/>
                    <bitfield caption="External Reset Flag" mask="0x02" name="EXTRF"/>
                    <bitfield caption="Power-On Reset Flag" mask="0x01" name="PORF"/>
                </register>
                <register caption="Sleep Mode Control Register" name="SMCR" offset="0x53" size="1">
                    <bitfield caption="Sleep Mode Select Bits" mask="0x06" name="SM" values="CPU_SLEEP_MODE2"/>
                    <bitfield caption="Sleep Enable" mask="0x01" name="SE"/>
                </register>
                <register caption="Oscillator Calibration Register" name="OSCCAL" offset="0x66" size="1" mask="0xFF"
                          ocd-rw="R">
                    <bitfield caption="Oscillator Calibration " mask="0xFF" name="OSCCAL"/>
                </register>
                <register caption="Clock Prescale Register" name="CLKPR" offset="0x61" size="1" ocd-rw="R">
                    <bitfield caption="Clock Prescaler Change Enable" mask="0x80" name="CLKPCE"/>
                    <bitfield caption="Clock Prescaler Select Bits" mask="0x0F" name="CLKPS"
                              values="CPU_CLK_PRESCALE_4_BITS_SMALL"/>
                </register>
                <register caption="Clock Selection Register" name="CLKSELR" offset="0x63" size="1">
                    <bitfield caption="Clock Out - CKOUT fuse substitution" mask="0x40" name="COUT"/>
                    <bitfield caption="Clock Start-up Time bit 1 - SUT1 fuse substitution" mask="0x30" name="CSUT"/>
                    <bitfield caption="Clock Source Select bit 3 - CKSEL3 fuse substitution" mask="0x0F" name="CSEL"/>
                </register>
                <register caption="Clock Control &amp; Status Register" name="CLKCSR" offset="0x62" size="1">
                    <bitfield caption="Clock Control Change Enable" mask="0x80" name="CLKCCE"/>
                    <bitfield caption="Clock Ready Flag" mask="0x10" name="CLKRDY"/>
                    <bitfield caption="Clock Control bits" mask="0x0F" name="CLKC"
                              values="CPU_CLK_COMMAND_LIST_4_BITS"/>
                </register>
                <register caption="DebugWire data register" name="DWDR" offset="0x51" size="1" mask="0xFF" ocd-rw=""/>
                <register caption="General Purpose IO register 2" name="GPIOR2" offset="0x4B" size="1" mask="0xFF"/>
                <register caption="General Purpose register 1" name="GPIOR1" offset="0x4A" size="1" mask="0xFF"/>
                <register caption="General purpose register 0" name="GPIOR0" offset="0x3E" size="1" mask="0xFF"/>
                <register caption="Port Control Register" name="PORTCR" offset="0x32" size="1">
                    <bitfield caption="" mask="0x20" name="BBMB"/>
                    <bitfield caption="" mask="0x10" name="BBMA"/>
                    <bitfield caption="" mask="0x02" name="PUDB"/>
                    <bitfield caption="" mask="0x01" name="PUDA"/>
                </register>
            </register-group>
            <value-group caption="" name="CPU_SLEEP_MODE2">
                <value caption="Idle" name="IDLE" value="0x00"/>
                <value caption="ADC Noise Reduction (If Available)" name="ADC" value="0x01"/>
                <value caption="Power Down" name="PDOWN" value="0x02"/>
                <value caption="Reserved" name="VAL_0x03" value="0x03"/>
            </value-group>
            <value-group caption="" name="CPU_CLK_PRESCALE_4_BITS_SMALL">
                <value caption="1" name="VAL_0x00" value="0x00"/>
                <value caption="2" name="VAL_0x01" value="0x01"/>
                <value caption="4" name="VAL_0x02" value="0x02"/>
                <value caption="8" name="VAL_0x03" value="0x03"/>
                <value caption="16" name="VAL_0x04" value="0x04"/>
                <value caption="32" name="VAL_0x05" value="0x05"/>
                <value caption="64" name="VAL_0x06" value="0x06"/>
                <value caption="128" name="VAL_0x07" value="0x07"/>
                <value caption="256" name="VAL_0x08" value="0x08"/>
            </value-group>
            <value-group caption="" name="CPU_CLK_COMMAND_LIST_4_BITS">
                <value caption="No Command" name="VAL_0x00" value="0x00"/>
                <value caption="Disable Clock Source" name="VAL_0x01" value="0x01"/>
                <value caption="Enable Clock Source" name="VAL_0x02" value="0x02"/>
                <value caption="Request for Clock Availability" name="VAL_0x03" value="0x03"/>
                <value caption="Clock Source Switch" name="VAL_0x04" value="0x04"/>
                <value caption="Recovery System Clock Source Code" name="VAL_0x05" value="0x05"/>
                <value caption="Enable Watchdog in Automatic Reload Mode" name="VAL_0x06" value="0x06"/>
                <value caption="CKOUT Command" name="VAL_0x07" value="0x07"/>
                <value caption="From 0x08 up to 0x0F: No command" name="VAL_0x08" value="0x08"/>
            </value-group>
            <value-group caption="Oscillator Calibration Values" name="OSCCAL_VALUE_ADDRESSES">
                <value value="0x00" caption="8.0 MHz" name="8_0_MHz"/>
            </value-group>
        </module>
    </modules>
    <pinouts>
        <pinout name="SOIC20">
            <pin position="1" pad="PA0"/>
            <pin position="2" pad="PA1"/>
            <pin position="3" pad="PA2"/>
            <pin position="4" pad="PA3"/>
            <pin position="5" pad="AVCC"/>
            <pin position="6" pad="AGND"/>
            <pin position="7" pad="PA4"/>
            <pin position="8" pad="PA5"/>
            <pin position="9" pad="PA6"/>
            <pin position="10" pad="PA7"/>
            <pin position="11" pad="PB7"/>
            <pin position="12" pad="PB6"/>
            <pin position="13" pad="PB5"/>
            <pin position="14" pad="PB4"/>
            <pin position="15" pad="VCC"/>
            <pin position="16" pad="GND"/>
            <pin position="17" pad="PB3"/>
            <pin position="18" pad="PB2"/>
            <pin position="19" pad="PB1"/>
            <pin position="20" pad="PB0"/>
        </pinout>
        <pinout name="VQFN32">
            <pin position="1" pad="NC"/>
            <pin position="2" pad="NC"/>
            <pin position="3" pad="PA3"/>
            <pin position="4" pad="AVCC"/>
            <pin position="5" pad="AGND"/>
            <pin position="6" pad="NC"/>
            <pin position="7" pad="NC"/>
            <pin position="8" pad="NC"/>
            <pin position="9" pad="PA4"/>
            <pin position="10" pad="PA5"/>
            <pin position="11" pad="PA6"/>
            <pin position="12" pad="PA7"/>
            <pin position="13" pad="NC"/>
            <pin position="14" pad="PB7"/>
            <pin position="15" pad="PB6"/>
            <pin position="16" pad="NC"/>
            <pin position="17" pad="NC"/>
            <pin position="18" pad="PB5"/>
            <pin position="19" pad="PB4"/>
            <pin position="20" pad="VCC"/>
            <pin position="21" pad="GND"/>
            <pin position="22" pad="NC"/>
            <pin position="23" pad="NC"/>
            <pin position="24" pad="NC"/>
            <pin position="25" pad="PB3"/>
            <pin position="26" pad="PB2"/>
            <pin position="27" pad="PB1"/>
            <pin position="28" pad="PB0"/>
            <pin position="29" pad="PA0"/>
            <pin position="30" pad="PA1"/>
            <pin position="31" pad="PA2"/>
            <pin position="32" pad="NC"/>
        </pinout>
    </pinouts>
</target-description-file>
